{
  "ID": "",
  "Name": "Fate's Shepherd",
  "Category": "Unik",
  "ShortDescription": "Aku tidak memilih takdir ini. Takdirlah yang memilihku. Sekarang, aku harus menggembalakannya.",
  "Description": "Pengguna ditakdirkan untuk menjadi titik pusat dari sebuah peristiwa besar yang akan mengubah dunia. Skill ini secara pasif menarik orang, Relic, dan peristiwa penting ke dalam kehidupan pengguna, menjadikan mereka magnet bagi takdir. Mereka adalah protagonis yang ditulis oleh tangan alam semesta itu sendiri.",
  "Mechanism": {
    "Activation": "Pasif",
    "Cost": "Kehidupan pribadi yang normal dan tenang. Pengguna akan terus-menerus terseret ke dalam konflik, bahaya, dan pilihan sulit.",
    "Range": "Global.",
    "Duration": "Seumur hidup.",
    "Prerequisites": "Tidak ada"
  },
  "LimitationsAndWeaknesses": {
    "Limitations": "Pengguna tidak memiliki kendali atas takdir yang datang. Mereka adalah aktor utama, tetapi bukan sutradaranya.",
    "Weaknesses": "Orang-orang terdekat pengguna sering kali ikut terseret ke dalam bahaya. Beban mental karena menanggung tanggung jawab yang begitu besar bisa sangat menghancurkan."
  },
  "Evolution": {
    "Novice": "Penolakan: Pengguna mencoba lari dari takdirnya, yang sering kali hanya membuat konsekuensinya menjadi lebih buruk bagi semua orang.",
    "Adept": "Penerimaan: Pengguna menerima perannya dan mencoba yang terbaik untuk mengarahkan peristiwa ke hasil yang positif.",
    "Master": "Penguasaan: Pengguna tidak hanya menerima, tetapi mulai memahami aliran takdir di sekitarnya. Mereka belajar untuk mengantisipasi dan mempersiapkan diri untuk apa yang akan datang, mengubah peran dari sekadar aktor menjadi rekan sutradara.",
    "Ascendant": "*Nexus of Worlds*. Pengguna menjadi pilar takdir itu sendiri. Keberadaan mereka menstabilkan realitas dan pilihan mereka dapat menentukan nasib dunia selama beberapa generasi ke depan. Setelah peran mereka selesai, mereka sering kali menghilang dari dunia, menjadi bagian dari legenda."
  },
  "SynergyAndConflict": {
    "Synergy": "*Guiding Light* sering muncul pada orang-orang di sekitar *Fate's Shepherd* untuk membantu mereka. Skill ini secara alami akan menarik semua jenis skill dan kekuatan lain ke sisinya.",
    "Conflict": "Berkonflik dengan mereka yang ingin menentang takdir atau menciptakan dunia yang statis dan tidak berubah."
  },
  "LoreAndHistory": "Setiap zaman memiliki *Fate's Shepherd*-nya sendiri. Mereka adalah pahlawan atau penjahat legendaris yang ceritanya diceritakan dari generasi ke generasi. Dari seorang anak petani yang menyatukan kerajaan hingga seorang penyihir yang hampir menghancurkan dunia, keberadaan mereka adalah poros di mana roda sejarah berputar."
}