{
  "NarrativeStyle": "Orang ketiga terbatas",
  "Tone": "Serius dengan momen ringan",
  "ContinuityRules": [
    "Revisi cerita adalah proses penggabungan, bukan penggantian. Pertahankan narasi yang ada sambil mengintegrasikan ide-ide baru dari file revisi.",
    "Setiap bab baru harus memiliki `title` di dalam *front matter* agar muncul di daftar isi secara otomatis.",
    "Setiap file `index.md` di dalam folder bab (`_cerita/nama_bab/`) harus berisi rangkuman semua latar lokasi yang disebutkan dalam sub-bab terkait.",
    "Untuk karakter pendukung atau figuran, buat entri deskripsi di file `KARAKTER_PENDUKUNG.md` dengan format yang konsisten.",
    "Setiap kali mengubah atau menulis ulang sebuah bagian cerita, lakukan pemeriksaan silang dengan `GUIDE.md` dan bab-bab lain untuk memastikan tidak ada konflik plot, karakter, atau aturan dunia.",
    "Setiap halaman bab di situs harus secara otomatis menampilkan semua gambar yang ada di dalam folder bab tersebut, diurutkan berdasarkan nama file.",
    "Situs dikonfigurasi untuk selalu memuat versi terbaru dan tidak menyimpan cache di browser.",
    "Gunakan 'aku, kamu, kau, kita'. Hindari 'loe, gue', kecuali untuk dialog atau monolog internal karakter tertentu (seperti Bimo) dalam adegan yang bersifat komedi/santai.",
    "Setiap adegan baru dimulai di paragraf baru.",
    "Gunakan tanda kutip (“”) dan pisahkan tiap pembicara.",
    "Gabungkan deskripsi & aksi dengan narasi, buat agar lebih terasa dan dapat dibayangkan.",
    "Setiap bab atau sub-bab harus secara eksplisit menyebutkan latar lokasi utama di awal atau di bagian yang relevan untuk memberikan gambaran yang jelas kepada pembaca.",
    "Untuk setiap istilah asing yang dicetak miring (misalnya, `*spawn*`, `*glitch*`), tambahkan penjelasan singkat di bagian bawah cerita atau bab terkait."
  ],
  "MagicRules": {
    "AetherUsage": "Aturan penggunaan Aether/energi sihir.",
    "SpellLimits": "Batasan mantra dan sihir.",
    "ElementalAffinity": "Aturan afinitas elemen."
  },
  "WorldPhysics": {
    "Gravity": "Mengikuti hukum gravitasi dunia nyata, kecuali jika disebutkan secara eksplisit adanya anomali atau variasi.",
    "TimeFlow": "Mengikuti aliran waktu linear dunia nyata (satu detik di dunia nyata sama dengan satu detik di dunia cerita), kecuali jika disebutkan secara eksplisit adanya manipulasi waktu atau fenomena temporal.",
    "EnvironmentalImpact": "Dunia ini hidup; penggunaan sihir yang berlebihan dapat menciptakan ketidakseimbangan. Setiap pilihan dalam menggunakan kekuatan akan meninggalkan jejak di dunia (korupsi, berkah, kutukan)."
  },
  "CharacterAbilities": {
    "SkillProgression": "Aturan perkembangan skill karakter.",
    "PhysicalLimits": "Batasan fisik karakter."
  },
  "_Documentation": {
    "OverallPurpose": "File CONSISTENCY.json dirancang sebagai panduan utama untuk menjaga konsistensi narasi, logika dunia, dan karakteristik elemen-elemen cerita dalam novel Anda. Tujuannya adalah untuk memastikan bahwa setiap bagian cerita, karakter, sihir, atau aturan dunia tetap koheren dan tidak saling bertentangan seiring berjalannya waktu atau saat penulis yang berbeda mengerjakannya.",
    "NarrativeStyle": {
      "Purpose": "Mendefinisikan sudut pandang penceritaan yang digunakan di seluruh novel. Ini penting untuk menjaga suara narator tetap konsisten.",
      "Examples": [
        "Orang ketiga terbatas: Narator hanya mengetahui pikiran dan perasaan satu karakter pada satu waktu.",
        "Orang pertama: Cerita diceritakan dari sudut pandang \"aku\" oleh salah satu karakter.",
        "Orang ketiga mahatahu: Narator mengetahui segalanya tentang semua karakter dan peristiwa."
      ]
    },
    "Tone": {
      "Purpose": "Menentukan suasana emosional atau sikap umum yang ingin disampaikan oleh cerita kepada pembaca. Nada cerita memengaruhi bagaimana pembaca merasakan dan menafsirkan peristiwa.",
      "Examples": [
        "Serius dengan momen ringan: Cerita memiliki tema berat tetapi diselingi humor atau adegan santai.",
        "Gelap dan suram: Suasana cerita didominasi oleh kesedihan, keputusasaan, atau ancaman.",
        "Petualangan dan optimis: Cerita berfokus pada eksplorasi dan memiliki nuansa harapan."
      ]
    },
    "ContinuityRules": {
      "Purpose": "Daftar aturan umum yang harus dipatuhi untuk menjaga alur cerita tetap logis dan bebas dari plot hole. Ini mencakup aspek-aspek yang tidak spesifik pada sihir atau fisika dunia, tetapi lebih pada perkembangan naratif dan karakter.",
      "Examples": [
        "Jangan ubah sifat karakter tanpa alasan logis: Jika karakter berubah, harus ada peristiwa atau pengalaman yang memicunya.",
        "Jaga timeline sesuai urutan arc: Pastikan peristiwa terjadi dalam urutan kronologis yang benar atau sesuai dengan struktur arc yang telah ditetapkan.",
        "Relic hanya bisa digunakan sesuai deskripsi: Mencegah penggunaan artefak secara sembarangan yang bisa merusak plot.",
        "Setiap keputusan karakter harus memiliki konsekuensi yang logis: Menghindari solusi instan atau deus ex machina.",
        "Informasi yang diberikan kepada pembaca harus konsisten: Hindari kontradiksi dalam fakta-fakta yang disajikan."
      ]
    },
    "MagicRules": {
      "Purpose": "Mendefinisikan bagaimana sistem sihir bekerja di dunia Anda. Ini sangat penting untuk genre fantasi agar sihir tidak terasa seperti \"solusi ajaib\" untuk setiap masalah.",
      "Examples": [
        "AetherUsage: Menjelaskan bagaimana energi sihir (Aether) dikonsumsi atau diisi ulang.",
        "SpellLimits: Batasan pada kekuatan, durasi, atau jumlah mantra yang bisa digunakan.",
        "ElementalAffinity: Bagaimana hubungan karakter dengan elemen memengaruhi kemampuan sihir mereka."
      ]
    },
    "WorldPhysics": {
      "Purpose": "Menetapkan aturan dasar tentang bagaimana dunia fisik beroperasi. Ini membantu membangun fondasi yang realistis (atau konsisten secara fantasi) untuk lingkungan cerita.",
      "Examples": [
        "Gravity: Apakah gravitasi sama dengan Bumi, atau ada variasi?",
        "TimeFlow: Apakah waktu selalu berjalan linear, atau ada fenomena yang bisa memanipulasinya?",
        "EnvironmentalImpact: Bagaimana tindakan karakter (misalnya, penggunaan sihir besar-besaran) memengaruhi lingkungan sekitar."
      ]
    },
    "CharacterAbilities": {
      "Purpose": "Menentukan bagaimana kemampuan dan skill karakter berkembang atau dibatasi dalam cerita. Ini memastikan bahwa pertumbuhan karakter terasa organik dan masuk akal.",
      "Examples": [
        "SkillProgression: Aturan tentang bagaimana karakter memperoleh atau meningkatkan skill mereka (misalnya, melalui latihan, pengalaman, atau bimbingan).",
        "PhysicalLimits: Batasan fisik yang dimiliki karakter, bahkan jika mereka memiliki kekuatan super atau sihir."
      ]
    }
  }
}