{
  "Meta": {
    "Title": "Judul Cerita Keseluruhan",
    "Author": "AI / User",
    "Genre": ["Fantasy", "Adventure"],
    "World": "Deskripsi singkat dunia tempat cerita berlangsung.",
    "Rules": "Aturan narasi yang harus diikuti (misalnya: POV konsisten, tense present, gaya deskriptif, penggunaan istilah asing, dll.)."
  },
  "Chapters": [
    {
      "ChapterNumber": 1,
      "Title": "Judul Bab",
      "Summary": "Ringkasan singkat tentang peristiwa utama dan perkembangan karakter dalam bab ini.",
      "Scenes": [
        {
          "SceneNumber": 1,
          "Location": {
            "Name": "Nama tempat kejadian (misal: Hutan Asing, Reruntuhan Kuno)",
            "ID": "ID Lokasi dari LOCATIONS.json (misal: L001)"
          },
          "Time": "Waktu kejadian (misal: Pagi, Siang, Senja, Malam, Dini Hari)",
          "CharactersInvolved": [
            {
              "Name": "Nama Karakter (misal: Arga)",
              "ID": "ID Karakter dari CHARACTERS.json (misal: C001)",
              "RoleInScene": "Peran karakter dalam adegan ini (misal: Protagonis, Antagonis, Pendukung)",
              "Mood": "Suasana hati atau emosi dominan karakter dalam adegan tersebut.",
              "Goal": "Tujuan spesifik karakter dalam adegan tersebut.",
              "Conflict": "Konflik internal/eksternal yang dihadapi karakter dalam adegan tersebut."
            }
          ],
          "POV": {
            "CharacterName": "Nama Karakter POV (misal: Arga)",
            "CharacterID": "ID Karakter POV dari CHARACTERS.json (misal: C001)"
          },
          "Contents": [
            {
              "Type": "Exposition",
              "Text": "Latar cerita, sejarah, atau worldbuilding yang relevan dengan adegan ini. Gunakan untuk memberikan informasi latar belakang atau konteks."
            },
            {
              "Type": "Atmosphere",
              "Text": "Deskripsi suasana atau mood adegan (misal: mencekam, damai, ramai)."
            },
            {
              "Type": "Description",
              "Text": "Deskripsi visual, suara, aroma, sentuhan, rasa yang ingin ditekankan dalam adegan."
            },
            {
              "Type": "Action",
              "Actor": {
                "Name": "Nama Karakter Pelaku",
                "ID": "ID Karakter Pelaku"
              },
              "Text": "Deskripsi tindakan fisik karakter atau peristiwa yang terjadi."
            },
            {
              "Type": "Dialogue",
              "Speaker": {
                "Name": "Nama Karakter Pembicara",
                "ID": "ID Karakter Pembicara"
              },
              "Line": "Kalimat dialog yang diucapkan."
            },
            {
              "Type": "InnerThought",
              "Character": {
                "Name": "Nama Karakter yang Berpikir",
                "ID": "ID Karakter yang Berpikir"
              },
              "Text": "Isi hati, pikiran batin, atau refleksi internal karakter."
            },
            {
              "Type": "Emotion",
              "Character": {
                "Name": "Nama Karakter yang Merasakan",
                "ID": "ID Karakter yang Merasakan"
              },
              "Text": "Deskripsi emosi spesifik yang dirasakan karakter."
            },
            {
              "Type": "Clue",
              "Text": "Petunjuk atau informasi penting yang ditemukan atau diungkapkan dalam adegan."
            },
            {
              "Type": "Conflict",
              "Text": "Deskripsi ketegangan, pertarungan, atau konflik yang muncul."
            },
            {
              "Type": "Decision",
              "Character": {
                "Name": "Nama Karakter Pembuat Keputusan",
                "ID": "ID Karakter Pembuat Keputusan"
              },
              "Text": "Pilihan penting yang dibuat oleh karakter, dengan implikasi naratif."
            },
            {
              "Type": "Transition",
              "Text": "Transisi antar adegan, perubahan lokasi, atau perubahan waktu."
            },
            {
              "Type": "BattleMove",
              "Actor": {
                "Name": "Nama Karakter Pelaku",
                "ID": "ID Karakter Pelaku"
              },
              "Text": "Gerakan spesifik dalam pertempuran atau aksi tempur."
            },
            {
              "Type": "Vision",
              "Character": {
                "Name": "Nama Karakter yang Mengalami Visi",
                "ID": "ID Karakter yang Mengalami Visi"
              },
              "Text": "Penglihatan, ilusi, atau pengalaman visual/sensorik non-realistis yang dialami karakter."
            },
            {
              "Type": "NarratorNote",
              "Text": "Catatan narator atau komentar di luar cerita yang memberikan konteks atau pandangan."
            },
            {
              "Type": "Travelogue",
              "Text": "Deskripsi perjalanan atau pergerakan karakter dari satu titik ke titik lain. Ini adalah narasi perjalanan secara umum."
            },
            {
              "Type": "Flashback",
              "Text": "Momen kilas balik yang dialami karakter, relevan dengan adegan saat ini."
            },
            {
              "Type": "Foreshadowing",
              "Text": "Bayangan atau pertanda hal yang akan datang, bisa berupa deskripsi, dialog, atau peristiwa kecil."
            },
            {
              "Type": "Symbolism",
              "Text": "Narasi tentang simbol atau benda yang memiliki makna lebih dalam dalam konteks cerita."
            },
            {
              "Type": "Prophecy",
              "Text": "Ramalan, bisikan, atau nubuat yang relevan dengan masa depan cerita, bisa diucapkan atau ditemukan."
            },
            {
              "Type": "Dream",
              "Text": "Mimpi yang dialami karakter, bisa realistik atau surreal, dengan potensi makna tersembunyi."
            },
            {
              "Type": "Hallucination",
              "Text": "Halusinasi yang dialami karakter karena rasa takut, kelelahan, atau pengaruh sihir/zat."
            },
            {
              "Type": "ItemDiscovery",
              "Text": "Karakter menemukan benda penting atau relik. Sertakan detail item jika relevan.",
              "Item": {
                "Name": "Nama Item",
                "ID": "ID Item dari _items/item.json"
              }
            },
            {
              "Type": "MysteryEvent",
              "Text": "Kejadian aneh atau tak terjelaskan yang menjadi misteri dan memicu rasa ingin tahu."
            },
            {
              "Type": "Ritual",
              "Text": "Deskripsi adegan upacara, mantra, atau tradisi tertentu yang dilakukan."
            },
            {
              "Type": "Training",
              "Text": "Adegan latihan, perkembangan skill, atau penguasaan teknik baru oleh karakter.",
              "Skill": {
                "Name": "Nama Skill",
                "ID": "ID Skill dari _skills/skill.json"
              }
            },
            {
              "Type": "Strategy",
              "Text": "Perencanaan atau diskusi strategi sebelum aksi atau pertarungan besar."
            },
            {
              "Type": "Debate",
              "Text": "Perbedaan pendapat atau argumen antar karakter yang lebih bersifat intelektual daripada konflik emosional."
            },
            {
              "Type": "TestOrTrial",
              "Text": "Ujian atau tantangan formal/informal yang harus dilalui karakter."
            },
            {
              "Type": "Reveal",
              "Text": "Pengungkapan rahasia penting, kebenaran, atau informasi krusial."
            },
            {
              "Type": "Betrayal",
              "Actor": {
                "Name": "Nama Karakter Pengkhianat",
                "ID": "ID Karakter Pengkhianat"
              },
              "Text": "Deskripsi pengkhianatan yang dilakukan oleh karakter dekat atau sekutu."
            },
            {
              "Type": "Alliance",
              "Text": "Terbentuknya ikatan, perjanjian, atau kerja sama baru antar karakter/faksi."
            },
            {
              "Type": "Celebration",
              "Text": "Deskripsi perayaan, festival, atau pesta yang terjadi dalam cerita."
            },
            {
              "Type": "LetterOrMessage",
              "Text": "Isi surat, catatan, atau pesan yang ditemukan atau dikirim, dengan konteksnya."
            },
            {
              "Type": "Rumor",
              "Text": "Desas-desus atau gosip yang beredar dan memengaruhi persepsi dunia atau karakter."
            },
            {
              "Type": "MoralReflection",
              "Text": "Renungan karakter tentang etika, benar-salah, atau makna hidup."
            },
            {
              "Type": "ComicRelief",
              "Text": "Momen ringan atau lucu yang bertujuan untuk mencairkan suasana tegang."
            },
            {
              "Type": "Injury",
              "Text": "Fokus pada luka fisik atau mental yang dialami karakter, dengan detail dampaknya."
            },
            {
              "Type": "Recovery",
              "Text": "Proses penyembuhan karakter, baik fisik maupun emosional, setelah mengalami cedera atau trauma."
            },
            {
              "Type": "RelationshipShift",
              "Text": "Perubahan status atau dinamika hubungan antar karakter (misal: dari musuh jadi sekutu, dari teman jadi kekasih)."
            },
            {
              "Type": "Negotiation",
              "Text": "Dialog diplomatis, barter, atau tawar-menawar antar pihak."
            },
            {
              "Type": "FoilMoment",
              "Text": "Adegan di mana sifat kontras antar karakter ditonjolkan untuk menyoroti perbedaan mereka."
            },
            {
              "Type": "Omens",
              "Text": "Tanda alam atau fenomena yang dianggap membawa makna mistis atau pertanda."
            },
            {
              "Type": "Sacrifice",
              "Text": "Pengorbanan yang dilakukan karakter, baik besar maupun kecil, dengan dampaknya."
            }
          ],
          "Notes": "Catatan tambahan untuk AI atau penulis: gaya bahasa spesifik, pacing yang diinginkan, detail sensorik yang harus ditekankan, atau instruksi khusus lainnya untuk adegan ini."
        }
      ]
    }
  ]
}