{
  "Title": "Tingkat Penguasaan Elemen: Air",
  "Levels": [
    {
      "ID": "E_AI_L01",
      "LevelNumber": 1,
      "LevelName": "Koneksi Awal",
      "Control": "Hanya bisa merasakan keberadaan air dan sedikit menggerakkan permukaan air yang tenang.",
      "Scale": "Hanya bisa memengaruhi air dalam wadah kecil dalam jarak sentuh.",
      "Understanding": "Mulai merasakan esensi \"aliran\" dan \"siklus\" dari air.",
      "Influence": "Cukup untuk menyediakan air minum bersih atau menyiram tanaman."
    },
    {
      "ID": "E_AI_L02",
      "LevelNumber": 2,
      "LevelName": "Manipulasi Dasar",
      "Control": "Mampu menarik dan mendorong air dalam jumlah kecil, menciptakan aliran lemah yang terarah.",
      "Scale": "Bisa mengendalikan air sebanyak satu ember dari sumber terdekat.",
      "Understanding": "Mengerti cara memberi arah pada medium cair.",
      "Influence": "Mampu mengalihkan aliran parit kecil atau mengisi beberapa wadah dengan cepat."
    },
    {
      "ID": "E_AI_L03",
      "LevelNumber": 3,
      "LevelName": "Pembentukan Sederhana",
      "Control": "Mampu membentuk air menjadi bentuk dasar seperti bola atau perisai sementara yang tidak stabil.",
      "Scale": "Bisa memanipulasi air di kolam kecil atau menciptakan cambuk air pendek.",
      "Understanding": "Memahami bahwa air bisa memiliki kepadatan dan bentuk sesaat.",
      "Influence": "Semburan airnya bisa mendorong orang dewasa atau memadamkan api unggun yang besar."
    },
    {
      "ID": "E_AI_L04",
      "LevelNumber": 4,
      "LevelName": "Kontrol Tekanan",
      "Control": "Mampu meningkatkan tekanan internal air, membuatnya mampu mendorong dengan kuat atau memotong benda lunak.",
      "Scale": "Bisa menciptakan semburan air bertekanan tinggi dari telapak tangan.",
      "Understanding": "Mengerti konsep tekanan hidrolik dan potensi kekuatan air yang terkompresi.",
      "Influence": "Bisa menciptakan perisai es sementara yang menahan satu serangan fisik, atau jet air yang melukai."
    },
    {
      "ID": "E_AI_L05",
      "LevelName": "Penguasaan Kemurnian",
      "Control": "Mampu menyaring kotoran dari air dan menyalurkan energi positif ke dalamnya.",
      "Scale": "Bisa memurnikan beberapa liter air atau menyembuhkan luka gores.",
      "Understanding": "Mengerti sifat air sebagai medium kehidupan dan pemurnian.",
      "Influence": "Airnya bisa menyembuhkan luka sayat ringan dan menetralkan racun umum."
    },
    {
      "ID": "E_AI_L06",
      "LevelNumber": 6,
      "LevelName": "Penguasaan Suhu",
      "Control": "Mampu mengubah suhu air secara signifikan, dari panas mendidih hingga dingin membekukan.",
      "Scale": "Bisa memengaruhi suhu air dalam sebuah ruangan atau menciptakan dinding es tipis.",
      "Understanding": "Mengerti hubungan antara energi dan tiga wujud air (cair, padat, gas).",
      "Influence": "Mampu menciptakan banjir setinggi mata kaki, pusaran air yang menjerat, atau dinding es yang kokoh."
    },
    {
      "ID": "E_AI_L07",
      "LevelName": "Penguasaan Wujud Ganda",
      "Control": "Mampu mengendalikan air dalam wujud cair dan padat (es) secara bersamaan dengan presisi tinggi.",
      "Scale": "Bisa menciptakan struktur es kompleks sambil tetap memanipulasi aliran air di sekitarnya.",
      "Understanding": "Memahami transisi fase sebagai senjata dan alat serbaguna.",
      "Influence": "Bisa merebus air di kolam kecil atau membekukan permukaan danau hingga ke dasarnya."
    },
    {
      "ID": "E_AI_L08",
      "LevelName": "Penguasaan Medan Air",
      "Control": "Mampu mengendalikan badan air yang besar seperti sungai atau danau kecil dengan kehendak.",
      "Scale": "Bisa menciptakan ombak besar, pusaran air raksasa, atau bahkan membelah air sementara.",
      "Understanding": "Mengerti dinamika fluida dalam skala besar dan bagaimana memanfaatkannya.",
      "Influence": "Air bisa menjadi seberat merkuri, seringan kabut yang menyesakkan, atau menjadi cermin cair yang memantulkan sihir."
    },
    {
      "ID": "E_AI_L09",
      "LevelName": "Konsep Kelembapan",
      "Control": "Mampu menarik dan memadatkan uap air dari udara, tanah, atau bahkan makhluk hidup.",
      "Scale": "Bisa menciptakan sumber air di tempat kering atau memanggil hujan badai lokal.",
      "Understanding": "Mengerti bahwa air ada di mana-mana dalam berbagai bentuk dan merupakan bagian dari siklus global.",
      "Influence": "Mampu memanggil hujan badai besar atau menciptakan gletser kecil yang mengubah lanskap."
    },
    {
      "ID": "E_AI_L10",
      "LevelNumber": 10,
      "LevelName": "Kesatuan Abadi",
      "Control": "Kehendak pengguna adalah hukum bagi semua air, dari tetesan embun hingga lautan.",
      "Scale": "Mampu memanggil tsunami, menciptakan kehidupan dari air murni, atau menyatu dengan lautan.",
      "Understanding": "Pengguna tidak lagi *menggunakan* air. Pengguna *adalah* siklus air itu sendiri.",
      "Influence": "Menjadi sumber mata air abadi yang tidak pernah kering, atau mampu mengendalikan pasang surut lautan."
    }
  ]
}