{
  "ID": "",
  "Name": "Memory Tracker",
  "Category": "Rohani",
  "ShortDescription": "Setiap benda menyimpan kenangan. Aku hanya perlu menyentuhnya.",
  "Description": "Dengan menyentuh sebuah objek, pengguna dapat melihat jejak atau fragmen memori yang paling kuat melekat pada objek tersebut. Ini bisa berupa siapa pemilik terakhirnya, peristiwa penting yang terjadi di sekitarnya, atau emosi kuat yang pernah diserapnya.",
  "Mechanism": {
    "Activation": "Aktif",
    "Cost": "Konsumsi Aether dalam jumlah sedang. Semakin tua atau semakin banyak memori sebuah objek, semakin besar biayanya.",
    "Range": "Sentuhan.",
    "Duration": "Visi berlangsung beberapa detik hingga satu menit.",
    "Prerequisites": "Tidak ada"
  },
  "LimitationsAndWeaknesses": {
    "Limitations": "Hanya bisa melihat memori yang paling kuat atau yang paling baru. Tidak bisa memilih memori spesifik yang ingin dilihat.",
    "Weaknesses": "Menyentuh objek dengan sejarah yang kelam atau traumatis (seperti senjata pembunuhan) bisa sangat berbahaya dan menyebabkan guncangan mental pada pengguna. Memori yang dilihat sering kali tidak lengkap dan tanpa konteks, seperti potongan puzzle."
  },
  "Evolution": {
    "Novice": "Hanya bisa merasakan emosi dasar yang melekat pada objek.",
    "Adept": "Mampu melihat gambaran visual yang kabur dari pemilik terakhir objek.",
    "Master": "Mampu melihat fragmen peristiwa penting yang melibatkan objek dengan cukup jelas. Bisa mencoba fokus pada jejak memori orang tertentu.",
    "Ascendant": "*Chronicle Touch*. Pengguna bisa menelusuri seluruh \"kehidupan\" sebuah objek dari awal pembuatannya hingga saat ini, melihat semua pemilik dan peristiwa penting secara berurutan, seolah-olah menonton sebuah film sejarah."
  },
  "SynergyAndConflict": {
    "Synergy": "Sangat kuat jika digunakan bersama *Forgotten Voice* untuk mendapatkan konteks dari apa yang dilihat. Berguna untuk detektif dan sejarawan.",
    "Conflict": "Tidak ada konflik langsung."
  },
  "LoreAndHistory": "Skill ini adalah alat yang sangat berharga bagi para penegak hukum di kota-kota besar untuk memecahkan kasus kejahatan. Namun, di tangan yang salah, skill ini bisa digunakan untuk mencuri rahasia atau memeras orang. Ada sebuah guild rahasia bernama \"The Archivists\" yang anggotanya memiliki skill ini dan bertugas untuk menemukan dan melindungi artefak berbahaya dengan membaca sejarahnya."
}