{
  "ID": "",
  "Name": "Perfect Mimic",
  "Category": "Unik",
  "ShortDescription": "Tunjukkan padaku sekali, dan aku akan menunjukkannya kembali padamu dengan lebih baik.",
  "Description": "Pengguna mampu meniru skill fisik atau sihir sederhana apa pun dengan sempurna setelah melihatnya digunakan satu kali. Peniruan ini tidak hanya menyalin gerakan atau mantra, tetapi juga esensi di baliknya, memungkinkan pengguna untuk sering kali menggunakan skill yang ditiru dengan lebih efisien daripada pemilik aslinya.",
  "Mechanism": {
    "Activation": "Aktif",
    "Cost": "Biaya untuk menggunakan skill yang ditiru sama dengan atau sedikit lebih rendah dari pemilik aslinya. Proses meniru itu sendiri membutuhkan konsentrasi tinggi.",
    "Range": "Penglihatan (harus melihat skill digunakan).",
    "Duration": "Pengguna bisa menyimpan beberapa skill yang ditiru dalam \"memori\" mereka, tetapi tidak bisa menyimpan terlalu banyak sekaligus.",
    "Prerequisites": "Tidak ada"
  },
  "LimitationsAndWeaknesses": {
    "Limitations": "Tidak bisa meniru Skill Unik atau sihir yang sangat kompleks dan kuat.",
    "Weaknesses": "Tidak bisa meniru skill yang membutuhkan prasyarat fisik atau spiritual tertentu yang tidak dimiliki pengguna (misalnya, tidak bisa meniru sihir darah tanpa melakukan pengorbanan). Jika pengguna berhenti menggunakan skill yang ditiru untuk waktu yang lama, ingatan tentangnya akan memudar."
  },
  "Evolution": {
    "Novice": "Mampu meniru satu skill sederhana pada satu waktu.",
    "Adept": "Mampu menyimpan 2-3 skill dalam memori dan beralih di antaranya.",
    "Master": "Mampu meniru skill dengan sedikit modifikasi, menyesuaikannya dengan gaya bertarung sendiri. Proses peniruan menjadi instan.",
    "Ascendant": "*Skill Weaver*. Pengguna tidak hanya meniru, tetapi mampu membongkar esensi dari beberapa skill yang telah ditiru dan menenunnya kembali menjadi skill hybrid yang benar-benar baru dan unik. Ini adalah puncak dari kemampuan adaptasi."
  },
  "SynergyAndConflict": {
    "Synergy": "Skill yang sangat serbaguna dan bisa beradaptasi dengan situasi apa pun. Sangat kuat di tangan seorang petarung yang cerdas.",
    "Conflict": "Tidak ada konflik langsung, tetapi sifatnya yang \"meminjam\" mungkin dipandang rendah oleh mereka yang menghargai orisinalitas dan kerja keras."
  },
  "LoreAndHistory": "Pengguna skill ini sering kali menjadi mata-mata, pembunuh bayaran, atau petualang yang serba bisa. Ada cerita tentang seorang penipu legendaris yang berhasil menyusup ke akademi sihir paling bergengsi di dunia dan menjadi lulusan terbaik hanya dengan meniru sihir dari teman-teman sekelasnya, tanpa memiliki bakat sihir bawaan sama sekali."
}