[
  {
    "id": 1,
    "event_name": "Perang Besar Pertama (The First Great War)",
    "date": "Berakhir pada Tahun 0 AE",
    "description": "Konflik global masif yang melibatkan hampir semua ras dan kerajaan. Penggunaan sihir dan Relic kuno secara besar-besaran menyebabkan kehancuran luas dan mengubah geografi dunia. Perang ini berakhir dengan Perjanjian Aethelgard yang rapuh.",
    "significance": "Menandai akhir dari Era Kuno dan dimulainya Era Aether (AE). Banyak pengetahuan dan teknologi kuno hilang. Kerajaan-kerajaan besar runtuh dan yang baru mulai terbentuk.",
    "related_novels": ["Latar belakang sejarah untuk semua novel"],
    "impact": {
      "politik": "Struktur kekuasaan global bergeser total, aliansi baru terbentuk dari sisa-sisa kerajaan lama.",
      "geografis": "Beberapa daratan hancur atau berubah secara drastis, menciptakan zona sihir liar.",
      "sosial": "Trauma perang menyebabkan ketidakpercayaan antar ras yang bertahan selama berabad-abad."
    }
  },
  {
    "id": 2,
    "event_name": "Pendirian Kerajaan Eldoria",
    "date": "Sekitar Tahun 50 AE",
    "description": "Didirikan dari sisa-sisa aliansi manusia dan elf setelah Perang Besar Pertama. Menjadi salah satu kerajaan paling stabil dan kuat di benua tengah.",
    "significance": "Pusat politik dan budaya di wilayah tersebut. Sering menjadi latar utama dalam banyak cerita.",
    "related_novels": ["Pecahan Dunia"],
    "impact": {
      "politik": "Menciptakan kekuatan dominan di benua tengah yang menjaga stabilitas regional.",
      "sosial": "Menjadi contoh keberhasilan aliansi antar ras (manusia dan elf)."
    }
  },
  {
    "id": 3,
    "event_name": "Wabah Bayangan (The Shadow Plague)",
    "date": "Tahun 450-460 AE",
    "description": "Wabah misterius yang menyebar di benua selatan, mengubah makhluk hidup menjadi monster bayangan. Wabah ini berhasil dihentikan oleh sekelompok penyihir kuat yang mengorbankan diri.",
    "significance": "Meninggalkan 'Tanah Terluka' (Wounded Lands) yang berbahaya dan penuh monster. Menjadi pengingat akan ancaman dari dimensi bayangan.",
    "related_novels": ["Referensi sejarah dalam 'Pecahan Dunia'"],
    "impact": {
      "geografis": "Menciptakan zona terkontaminasi permanen (Tanah Terluka) yang tidak bisa dihuni.",
      "sosial": "Menimbulkan ketakutan mendalam terhadap sihir bayangan dan entitas dari dimensi lain."
    }
  }
]