{
  "ID": "",
  "Name": "Aura Reader",
  "Category": "Rohani",
  "ShortDescription": "Warna jiwa tidak pernah berbohong.",
  "Description": "Pengguna mampu melihat aura yang memancar dari makhluk hidup. Aura ini merefleksikan emosi, niat, dan kondisi fisik target secara real-time. Warna, intensitas, dan bentuk aura memberikan wawasan mendalam yang tidak bisa ditangkap oleh indra biasa.",
  "Mechanism": {
    "Activation": "Aktif",
    "Cost": "Konsumsi Aether dalam jumlah kecil secara terus-menerus selama aktif.",
    "Range": "Penglihatan (semua target yang terlihat oleh pengguna).",
    "Duration": "Selama diaktifkan.",
    "Prerequisites": "Tidak ada"
  },
  "LimitationsAndWeaknesses": {
    "Limitations": "Aura bisa menjadi sangat kompleks dan sulit diinterpretasikan, terutama pada individu dengan emosi yang bergejolak atau jiwa yang rumit.",
    "Weaknesses": "Beberapa makhluk atau individu yang sangat kuat mampu menekan atau bahkan memalsukan aura mereka, sehingga bisa menipu pengguna skill ini. Melihat terlalu banyak aura sekaligus (misalnya di tengah keramaian) bisa menyebabkan sakit kepala dan kebingungan."
  },
  "Evolution": {
    "Novice": "Hanya bisa melihat warna dasar emosi (merah untuk marah, biru untuk sedih).",
    "Adept": "Mampu membedakan nuansa warna yang lebih kompleks, seperti niat berbohong (aura beriak) atau penyakit (aura kusam).",
    "Master": "Bisa membaca jejak aura yang tertinggal pada benda atau lokasi, mengetahui siapa yang ada di sana dan apa yang mereka rasakan.",
    "Ascendant": "*Soul Gaze*. Pengguna tidak hanya melihat aura, tetapi bisa melihat langsung ke dalam jiwa target, memahami hasrat terdalam, ketakutan, dan bahkan melihat fragmen ingatan mereka."
  },
  "SynergyAndConflict": {
    "Synergy": "Sangat berguna bagi *Heartspeaker* (skill legendaris) untuk memahami audiens mereka. Juga membantu dalam diplomasi dan interogasi.",
    "Conflict": "Penggunaan bersamaan dengan sihir ilusi yang kuat dapat mengganggu persepsi aura dan memberikan informasi yang salah."
  },
  "LoreAndHistory": "Skill ini sering dimiliki oleh para penasihat kerajaan, diplomat, dan detektif di kota-kota besar. Konon, Permaisuri pertama dari Kerajaan Cahaya memiliki skill ini dan menggunakannya untuk menjaga perdamaian dengan mengetahui niat sejati dari setiap duta besar yang datang ke istananya."
}