{
  "ID": "",
  "Name": "Echoing Prophecy",
  "Category": "Rohani",
  "ShortDescription": "Masa depan berbisik, bukan berteriak. Hanya jiwa yang tenang yang bisa mendengarnya.",
  "Description": "Pengguna sesekali menerima gema atau fragmen ramalan tentang masa depan. Ramalan ini tidak datang atas kehendak, melainkan muncul secara spontan dalam bentuk bisikan, mimpi, atau dejavu yang kuat. Gema ini sering kali samar dan metaforis.",
  "Mechanism": {
    "Activation": "Pasif",
    "Cost": "Tidak ada biaya langsung, tetapi setiap ramalan yang datang sering kali menyebabkan kelelahan mental atau migrain.",
    "Range": "Tidak relevan.",
    "Duration": "Ramalan datang secara acak.",
    "Prerequisites": "Tidak ada"
  },
  "LimitationsAndWeaknesses": {
    "Limitations": "Pengguna tidak bisa mengontrol kapan atau tentang apa ramalan itu akan datang.",
    "Weaknesses": "Ramalan sangat sulit diinterpretasikan dan bisa disalahartikan, terkadang membawa ke hasil yang lebih buruk jika ditindaklanjuti dengan salah. Semakin besar atau penting sebuah ramalan, semakin besar pula beban mental yang ditimbulkannya."
  },
  "Evolution": {
    "Novice": "Menerima firasat atau dejavu sederhana tentang kejadian sepele.",
    "Adept": "Menerima mimpi atau bisikan samar tentang peristiwa penting yang akan datang.",
    "Master": "Mampu dengan sengaja memasuki kondisi meditasi untuk mencoba memancing gema ramalan, meskipun tetap tidak ada jaminan. Interpretasinya menjadi lebih akurat.",
    "Ascendant": "*Oracle's Clarity*. Ramalan yang datang menjadi jauh lebih jelas, terkadang dalam bentuk visi langsung. Pengguna bisa mengajukan satu pertanyaan spesifik ke dalam aliran takdir dan menerima jawaban metaforis dalam mimpinya, meskipun ini sangat berbahaya dan menguras jiwa."
  },
  "SynergyAndConflict": {
    "Synergy": "Bekerja baik dengan *Aura Reader* untuk mengkonfirmasi apakah seseorang terkait dengan ramalan. *Spirit Bridge* juga bisa membantu meminta petunjuk dari arwah untuk mengartikan ramalan.",
    "Conflict": "Berbenturan dengan skill yang memanipulasi takdir seperti *Fates's Knot*, karena dapat menciptakan gema ramalan yang saling bertentangan dan membingungkan."
  },
  "LoreAndHistory": "Para peramal di kuil-kuil kuno sering kali merupakan pemilik skill ini. Mereka dianggap sebagai penyambung lidah para dewa. Namun, banyak dari mereka yang berakhir gila karena tidak mampu menanggung beban dari semua kemungkinan masa depan yang mereka lihat. Sejarah mencatat beberapa perang besar dimulai atau dihindari karena interpretasi dari sebuah *Echoing Prophecy*."
}