{
  "ID": "",
  "Name": "Spirit Bridge",
  "Category": "Rohani",
  "ShortDescription": "Kematian bukanlah akhir, hanya perbatasan. Dan aku adalah penjaganya.",
  "Description": "Pengguna mampu bertindak sebagai jembatan antara dunia orang hidup dan dunia arwah. Mereka bisa melihat, mendengar, dan berkomunikasi dengan roh-roh yang masih terikat dengan dunia. Dalam tingkat yang lebih tinggi, mereka bahkan bisa membantu roh menyeberang atau meminta bantuan mereka.",
  "Mechanism": {
    "Activation": "Aktif",
    "Cost": "Membutuhkan ketenangan mental dan konsentrasi. Berkomunikasi dengan roh yang kuat atau marah bisa sangat menguras energi jiwa.",
    "Range": "Area di sekitar pengguna (sekitar 20 meter).",
    "Duration": "Selama pengguna mampu menjaga konsentrasi.",
    "Prerequisites": "Tidak ada"
  },
  "LimitationsAndWeaknesses": {
    "Limitations": "Tidak semua roh ramah. Beberapa bisa menjadi berbahaya, pendendam, atau mencoba menipu pengguna.",
    "Weaknesses": "Membuka jembatan terlalu lama atau terlalu sering dapat menarik perhatian entitas yang lebih kuat dan berbahaya dari dunia arwah. Pengguna menjadi sangat rentan terhadap serangan fisik saat sedang berkonsentrasi penuh untuk berkomunikasi dengan roh."
  },
  "Evolution": {
    "Novice": "Hanya bisa merasakan kehadiran arwah di sekitar.",
    "Adept": "Mampu melihat dan mendengar arwah, serta melakukan komunikasi dasar.",
    "Master": "Mampu meminta bantuan kecil dari arwah (misalnya, menanyakan informasi atau meminta mereka mengalihkan perhatian). Bisa membantu roh yang tersesat untuk menemukan kedamaian.",
    "Ascendant": "Soul Anchor. Pengguna mampu untuk sementara \"menjangkarkan\" satu roh sekutu ke dunia fisik, memberinya bentuk semi-nyata yang bisa berinteraksi dengan benda atau bahkan menyerang musuh. Ini adalah teknik yang sangat berisiko dan membutuhkan pengorbanan besar."
  },
  "SynergyAndConflict": {
    "Synergy": "Berguna untuk mendapatkan informasi dari masa lalu. Echoing Prophecy bisa mendapatkan petunjuk dari arwah untuk mengartikan ramalan.",
    "Conflict": "Berbahaya jika digunakan di dekat area dengan sihir necromancy yang kuat, karena bisa merusak jembatan dan melepaskan arwah jahat secara tidak terkendali."
  },
  "LoreAndHistory": "Para medium, dukun, dan pendeta pemakaman sering kali memiliki skill ini. Mereka dihormati dan ditakuti karena hubungan mereka dengan kematian. Dalam beberapa budaya, mereka dianggap suci dan bertugas untuk memastikan arwah para leluhur tetap tenang dan menjaga desa mereka. Dalam budaya lain, mereka dikucilkan karena dianggap membawa pertanda buruk."
}