{
  "Meta": {
    "Title": "1.4 - Lumpuh oleh Imajinasi",
    "Author": "AI / User",
    "Genre": ["Fantasy", "Adventure", "Psychological", "Comedy"],
    "World": "Dunia fantasi dengan sihir dan makhluk mitos.",
    "Rules": "POV konsisten, tense present, gaya deskriptif."
  },
  "Chapters": [
    {
      "ChapterNumber": 1,
      "Title": "Chapter 01 - Terjatuh ke Dunia Lain",
      "Summary": "Lina, seorang siswi SMA yang perfeksionis dan manja, terbangun di lingkungan yang tidak sesuai standarnya. Keluhan dan sifat sarkastiknya menjadi kontras yang tajam dengan bahaya nyata yang dihadapinya saat ia dilumpuhkan oleh rasa takut.",
      "Scenes": [
        {
          "SceneNumber": 4,
          "Location": {
            "Name": "Bawah Akar Pohon Raksasa",
            "ID": "L004"
          },
          "Time": "Pagi",
          "CharactersInvolved": [
            {
              "Name": "Lina",
              "ID": "C005",
              "RoleInScene": "Protagonis",
              "Mood": "Jijik, takut, sarkastik, manja",
              "Goal": "Menghindari kotoran dan ketidaknyamanan",
              "Conflict": "Pikiran dan keluhannya sendiri menghalanginya untuk bereaksi terhadap bahaya."
            }
          ],
          "POV": {
            "CharacterName": "Lina",
            "CharacterID": "C005"
          },
          "Contents": [
            {
              "Type": "Exposition",
              "Text": "Lina terbangun dengan sentakan yang tidak elegan. Hal pertama yang menyambutnya adalah bau tanah basah dan jamur yang menusuk hidung. Ia terbaring di bawah akar pohon raksasa yang melengkung secara tidak simetris, sebuah pelanggaran arsitektur alam yang membuatnya muak."
            },
            {
              "Type": "Dialogue",
              "Speaker": { "Name": "Lina", "ID": "C005" },
              "Line": "Iyuuh! Tempat apa ini? Lantainya tanah semua, dan lihat ini, daun kering menempel di blazerk-ku! Menjijikkan!",
              "Tone": "Mengeluh"
            },
            {
              "Type": "InnerThought",
              "Character": { "Name": "Lina", "ID": "C005" },
              "Text": "Pencahayaannya juga buruk sekali, tidak ada golden ratio sama sekali. Siapa desainer level ini? Benar-benar tidak profesional."
            },
            {
              "Type": "EnemyEncounter",
              "Text": "Saat ia sibuk menggerutu, ia merasakan hawa dingin yang aneh. Dua sosok kecil berwarna hijau kusam muncul dari semak-semak. Postur mereka bungkuk, gerakan mereka tidak efisien, dan desain mereka... sangat klise. Goblin.",
              "Enemy": "Goblin"
            },
            {
              "Type": "Dialogue",
              "Speaker": { "Name": "Lina", "ID": "C005" },
              "Line": "Oh, hebat. Monster. Tentu saja. Kenapa tidak sekalian saja ada naga ungu yang menyanyikan lagu anak-anak? Biar makin absurd.",
              "Tone": "Sarkastik"
            },
            {
              "Type": "Emotion",
              "Character": { "Name": "Lina", "ID": "C005" },
              "Text": "Meskipun mulutnya masih bisa melontarkan sarkasme, tubuhnya mengkhianatinya. Kakinya terasa seperti jeli, menolak untuk menuruti perintah otaknya untuk lari. Kengerian yang dingin dan lengket merayap di tulang punggungnya, melumpuhkannya dari dalam.",
              "Intensity": "High"
            },
            {
              "Type": "InnerThought",
              "Character": { "Name": "Lina", "ID": "C005" },
              "Text": "Oke, ini tidak lucu lagi. Sepatuku bisa rusak. Dan aku belum update story hari ini. Kalau aku mati di sini, siapa yang akan mengurus tanamanku di game? Ini benar-benar tidak bisa diterima!"
            },
            {
              "Type": "ImminentThreat",
              "Text": "Satu goblin maju, seringainya memperlihatkan gigi-gigi kuning yang tidak rata. Ia mengulurkan tangan kurusnya, kuku-kuku hitamnya yang panjang hampir menyentuh ujung sepatunya yang (sebelumnya) putih bersih."
            },
            {
              "Type": "UnexpectedAid",
              "Source": "Bimo",
              "Text": "Tepat saat Lina memejamkan mata, pasrah pada nasibnya yang tidak higienis, sebuah teriakan sumbang memekakkan telinga bergema di hutan. \"HOI! MAKHLUK JELEK!\""
            },
            {
              "Type": "InnerThought",
              "Character": { "Name": "Lina", "ID": "C005" },
              "Text": "Ya ampun, telingaku! Siapa yang berteriak dengan nada seburuk itu? Tidak punya etika sama sekali. Mengganggu ketenangan publik."
            },
            {
              "Type": "Action",
              "Actor": { "Name": "Lina", "ID": "C005" },
              "Text": "Para goblin, yang tampaknya juga terganggu oleh polusi suara itu, mengalihkan perhatian mereka. Kesempatan itu, sekecil apa pun, cukup bagi Lina. Adrenalin akhirnya menang. Ia menjatuhkan diri dan berguling ke celah sempit di bawah akar pohon, tidak peduli lagi pada kotoran."
            },
            {
              "Type": "Dialogue",
              "Speaker": { "Name": "Lina", "ID": "C005" },
              "Line": "Sial, sial, sial! Blazer-ku pasti robek! Dan ada lumut di rambutku, aku bisa merasakannya! Aku butuh mandi air panas dan seratus lembar tisu basah sekarang juga!",
              "Tone": "Panik dan mengeluh"
            },
            {
              "Type": "InnerThought",
              "Character": { "Name": "Lina", "ID": "C005" },
              "Text": "Oke, orang berisik itu mungkin bisa dimanfaatkan. Dia bisa jadi pengalih perhatian yang bagus sementara aku mencari jalan keluar yang beradab. Semoga di sana ada kafe dengan Wi-Fi. Atau setidaknya, toilet yang bersih."
            }
          ],
          "Notes": "Versi yang diperpanjang untuk menonjolkan kepribadian Lina yang manja, sarkastik, dan tidak pada tempatnya, menciptakan kontras antara bahaya nyata dan keluhan sepele."
        }
      ]
    }
  ]
}