{
  "Meta": {
    "Title": "1.3 - Napas yang Terengah",
    "Author": "AI / User",
    "Genre": ["Fantasy", "Adventure", "Survival", "Horror"],
    "World": "Dunia fantasi dengan sihir dan makhluk mitos.",
    "Rules": "POV konsisten, tense present, gaya deskriptif."
  },
  "Chapters": [
    {
      "ChapterNumber": 1,
      "Title": "Chapter 01 - Terjatuh ke Dunia Lain",
      "Summary": "Mira, seorang mahasiswi kedokteran yang perfeksionis, terbangun di padang rumput asing. Ketakutan dan kengerian yang mencekam memaksanya melampaui batas fisiknya saat ia melarikan diri dari kejaran goblin buas, menuju secercah harapan yang samar.",
      "Scenes": [
        {
          "SceneNumber": 3,
          "Location": {
            "Name": "Padang Rumput Asing",
            "ID": "L003"
          },
          "Time": "Pagi",
          "CharactersInvolved": [
            {
              "Name": "Mira",
              "ID": "C004",
              "RoleInScene": "Protagonis",
              "Mood": "Dari bingung menjadi panik dan ketakutan",
              "Goal": "Bertahan hidup",
              "Conflict": "Dikejar oleh goblin buas saat fisik tidak siap"
            }
          ],
          "POV": {
            "CharacterName": "Mira",
            "CharacterID": "C004"
          },
          "Contents": [
            {
              "Type": "Atmosphere",
              "Text": "Kesadaran datang perlahan, seperti merangkak keluar dari air yang dalam. Hal pertama yang Mira rasakan adalah kelembutan yang aneh di bawah punggungnya dan aroma bunga liar yang asing menusuk hidungnya. Langit di atasnya bukan biru yang menenangkan, melainkan kanvas sureal berwarna ungu lavender."
            },
            {
              "Type": "Action",
              "Actor": { "Name": "Mira", "ID": "C004" },
              "Text": "Jantungnya berdebar kencang, namun disiplin bertahun-tahun di fakultas kedokteran mengambil alih. Dengan napas yang tertahan, tangannya yang gemetar mulai bergerak secara metodis, melakukan pemeriksaan diri. Pergelangan kaki, lutut, panggul, tulang rusuk, bahu, leher. Setiap sentuhan adalah diagnosis cepat."
            },
            {
              "Type": "InnerThought",
              "Character": { "Name": "Mira", "ID": "C004" },
              "Text": "Tidak ada dislokasi. Tidak ada fraktur. Hanya lecet dan kemungkinan memar di beberapa titik. Aku... aku utuh. Tapi di mana ini?"
            },
            {
              "Type": "MysteriousPhenomenon",
              "Text": "Saat itulah ia menyadari sisa-sisa cahaya keperakan yang hangat memudar dari kulitnya, meninggalkan sensasi dingin dan rentan. Fenomena itu tidak masuk akal, menentang semua hukum biologi yang ia pelajari, namun rasa ingin tahu seorang peneliti sempat mengalahkan rasa takutnya."
            },
            {
              "Type": "EnemyEncounter",
              "Text": "Sebuah geraman rendah dan serak memecah keheningan, disusul bau amis yang memuakkan. Dari balik rerumputan tinggi, sesosok makhluk bungkuk muncul. Lalu satu lagi, dan satu lagi. Kulit mereka hijau kusam dan penuh kudis, mata merah kecil mereka berkilat dengan kecerdasan buas, dan liur menetes dari gigi-gigi runcing mereka. Goblin.",
              "Enemy": "Goblin"
            },
            {
              "Type": "Emotion",
              "Character": { "Name": "Mira", "ID": "C004" },
              "Text": "Darah seolah surut dari wajah Mira. Setiap insting di tubuhnya menjerit. Ini bukan pasien, bukan kasus medis. Ini adalah predator, dan ia adalah mangsanya. Kakinya terasa seperti terpaku ke tanah, suaranya tercekat di tenggorokan, lumpuh oleh kengerian murni.",
              "Intensity": "High"
            },
            {
              "Type": "Chase",
              "Pursuers": ["Goblin"],
              "Fleeing": ["C004"],
              "Text": "Dengan ledakan adrenalin yang menyakitkan, ia memaksa tubuhnya berbalik dan berlari. Udara dingin membakar paru-parunya. Kakinya yang tidak terbiasa bergerak kikuk, tersandung gundukan tanah yang tak terlihat. Suara derap langkah kecil dan geraman lapar terdengar semakin dekat di belakangnya."
            },
            {
              "Type": "Action",
              "Actor": { "Name": "Mira", "ID": "C004" },
              "Text": "Ia tersandung akar pohon yang menonjol dan jatuh tersungkur dengan keras. Rasa sakit tajam menjalari lututnya, dan keputusasaan mulai merayap masuk. Ia berbalik, mencoba merangkak mundur."
            },
            {
              "Type": "ImminentThreat",
              "Text": "Para goblin kini mengelilinginya, membentuk setengah lingkaran yang rapat. Seringai mereka melebar, memperlihatkan gusi yang menghitam. Bau busuk mereka membuatnya mual. Salah satu dari mereka, yang paling berani, mengulurkan tangan kurus dengan cakar kotor, siap meraihnya."
            },
            {
              "Type": "UnexpectedAid",
              "Source": "Bimo",
              "Text": "Tepat saat ujung cakar itu hampir menyentuh kain bajunya, sebuah teriakan melengking, nyaring, dan luar biasa konyol membelah udara. Teriakan itu begitu aneh hingga para goblin yang buas itu pun berhenti sejenak, kepala mereka menoleh ke sumber suara dengan kebingungan."
            },
            {
              "Type": "Action",
              "Actor": { "Name": "Mira", "ID": "C004" },
              "Text": "Jeda sepersekian detik itu adalah anugerah. Naluri untuk menolong, yang tertanam lebih dalam dari rasa takutnya, berkobar. Ada orang lain di sini! Seseorang dalam bahaya! Mengabaikan rasa sakit di lututnya, Mira mendorong tubuhnya bangkit dan berlari tertatih-tatih ke arah suara itu."
            },
            {
              "Type": "InnerThought",
              "Character": { "Name": "Mira", "ID": "C004" },
              "Text": "Aku tidak hanya lari dari mereka, aku harus lari menuju sesuatu. Menuju seseorang. Mungkin... mungkin bersama-sana, kami punya kesempatan."
            },
            {
              "Type": "Foreshadowing",
              "Text": "Di kejauhan, menembus pepohonan, siluet reruntuhan kuno yang hancur tampak menjulang, menjanjikan perlindungan atau mungkin bahaya yang lebih besar. Tanpa pilihan lain, ia terus berlari ke arahnya."
            }
          ],
          "Notes": "Versi yang diperpanjang untuk meningkatkan drama dan ketegangan. Menekankan pada konflik internal Mira antara rasa takut dan naluri medisnya untuk menolong."
        }
      ]
    }
  ]
}