{
  "ID": "",
  "Name": "Combat Adaptation",
  "Category": "Fisik",
  "ShortDescription": "Lawan yang sama tidak akan pernah bisa mengalahkanku dua kali.",
  "Description": "Tubuh dan insting pengguna secara otomatis beradaptasi dengan gaya bertarung, kekuatan, dan kelemahan lawan setelah beberapa saat. Semakin lama pertarungan berlangsung, semakin efektif pengguna dalam menahan serangan dan menemukan celah untuk menyerang balik.",
  "Mechanism": {
    "Activation": "Pasif",
    "Cost": "Tidak ada.",
    "Range": "Diri sendiri.",
    "Duration": "Adaptasi berlangsung selama pertarungan dan akan direset setelahnya.",
    "Prerequisites": "Tidak ada"
  },
  "LimitationsAndWeaknesses": {
    "Limitations": "Membutuhkan waktu untuk beradaptasi. Di awal pertarungan, pengguna sangat rentan.",
    "Weaknesses": "Tidak efektif jika melawan banyak musuh dengan gaya bertarung yang berbeda secara bersamaan. Adaptasi bersifat sementara. Jika bertemu lawan yang sama di lain hari, proses adaptasi harus dimulai dari awal, meskipun mungkin sedikit lebih cepat."
  },
  "Evolution": {
    "Novice": "Membutuhkan beberapa menit untuk mulai beradaptasi dengan serangan sederhana.",
    "Adept": "Proses adaptasi hanya membutuhkan beberapa detik. Mampu beradaptasi dengan sihir tingkat rendah.",
    "Master": "Mampu beradaptasi dengan cepat bahkan pada gaya bertarung yang kompleks atau sihir tingkat tinggi. Mulai bisa meniru sebagian kecil dari gerakan lawan.",
    "Ascendant": "*Perfect Counter*. Pengguna tidak hanya beradaptasi, tetapi secara instan mengembangkan teknik tandingan yang sempurna untuk setiap serangan yang datang, seolah-olah mereka telah berlatih melawan lawan tersebut seumur hidup."
  },
  "SynergyAndConflict": {
    "Synergy": "Bekerja dengan sangat baik bersama *Steel Body* atau *Eternal Breath* yang membantu pengguna bertahan lebih lama di awal pertarungan selagi proses adaptasi berjalan.",
    "Conflict": "Tidak ada konflik langsung, tetapi sifatnya yang reaktif mungkin tidak cocok untuk pengguna yang lebih suka pertarungan cepat dan agresif."
  },
  "LoreAndHistory": "Skill ini sering ditemukan pada ras-ras petarung yang hidup di lingkungan yang keras dan selalu berubah. Mereka tidak mengandalkan kekuatan mentah, tetapi pada kemampuan untuk belajar dan mengatasi segala ancaman. Salah satu pahlawan legendaris dengan skill ini konon pernah mengalahkan seekor naga hanya dengan tangan kosong setelah bertarung selama tiga hari tiga malam tanpa henti."
}