{
  "ID": "",
  "Name": "Steel Body",
  "Category": "Fisik",
  "ShortDescription": "Pedang mereka tumpul, panah mereka patah. Tubuhku adalah bentengku.",
  "Description": "Kulit, otot, dan bahkan tulang pengguna menjadi sekeras dan sepadat baja. Mereka mampu menahan serangan fisik dari senjata biasa seperti pedang, panah, atau pukulan tanpa terluka.",
  "Mechanism": {
    "Activation": "Pasif",
    "Cost": "Tidak ada. Namun, kepadatan tubuh yang meningkat membuat pengguna sedikit lebih berat dari manusia normal.",
    "Range": "Diri sendiri.",
    "Duration": "Permanen.",
    "Prerequisites": "Tidak ada"
  },
  "LimitationsAndWeaknesses": {
    "Limitations": "Tidak efektif melawan serangan sihir, racun, atau senjata yang ditempa dengan sihir kuat.",
    "Weaknesses": "Sangat rentan terhadap serangan yang bersifat menghancurkan dari dalam (seperti sihir ledakan internal) atau serangan tumpul berdaya hancur masif (seperti pukulan dari pengguna *Bull's Might*). Membuat pengguna sulit untuk berenang."
  },
  "Evolution": {
    "Novice": "Kulit sekeras kayu, mampu menahan goresan ringan.",
    "Adept": "Tubuh sekeras besi, mampu menahan tebasan pedang biasa.",
    "Master": "Tubuh sekeras baja, kebal terhadap sebagian besar senjata fisik non-sihir.",
    "Ascendant": "*Adamant Vessel*. Tubuh pengguna berevolusi menjadi material yang menyerupai logam mistis Adamantite. Tidak hanya kebal terhadap serangan fisik, tetapi juga memiliki resistensi tinggi terhadap sihir dan suhu ekstrem."
  },
  "SynergyAndConflict": {
    "Synergy": "Kombinasi sempurna dengan *Bull's Might* untuk menciptakan petarung garis depan yang brutal. Juga baik untuk melindungi pengguna skill Rohani atau Sihir yang tubuhnya rapuh.",
    "Conflict": "Sedikit mengurangi efektivitas skill kelincahan seperti *Shadow Step* karena bobot tubuh yang bertambah."
  },
  "LoreAndHistory": "Skill ini dikatakan berasal dari ras Kurcaci kuno yang tinggal di bawah gunung dan terus-menerus terpapar pada logam dan mineral langka. Mereka mengembangkan *Steel Body* secara alami sebagai bentuk adaptasi untuk bertahan hidup di lingkungan yang keras dan berbahaya. Beberapa pandai besi legendaris dari ras ini konon menggunakan tubuh mereka sendiri sebagai landasan tempa."
}