{
  "ID": "",
  "Name": "Weapon Mastery",
  "Category": "Fisik",
  "ShortDescription": "Senjata hanyalah perpanjangan dari kehendakku.",
  "Description": "Pengguna memiliki bakat alami untuk menguasai senjata apa pun yang mereka sentuh. Baik itu pedang, tombak, busur, atau bahkan senjata eksotis yang belum pernah mereka lihat sebelumnya, mereka dapat menggunakannya dengan tingkat kemahiran yang tinggi seolah-olah telah berlatih selama bertahun-tahun.",
  "Mechanism": {
    "Activation": "Pasif",
    "Cost": "Tidak ada.",
    "Range": "Diri sendiri.",
    "Duration": "Permanen.",
    "Prerequisites": "Tidak ada"
  },
  "LimitationsAndWeaknesses": {
    "Limitations": "Hanya memberikan kemahiran teknis, bukan kekuatan atau kecepatan. Pengguna tetap harus melatih atribut fisiknya.",
    "Weaknesses": "Tidak berlaku untuk Relic yang memiliki kesadaran dan memilih pemiliknya sendiri. Pengguna tetap harus membuktikan diri layak bagi Relic tersebut."
  },
  "Evolution": {
    "Novice": "Mampu menggunakan senjata umum (pedang, perisai) dengan baik.",
    "Adept": "Mampu menggunakan hampir semua jenis senjata dengan mahir.",
    "Master": "Mampu melemparkan senjata apa pun dengan akurasi mematikan atau menggunakan benda-benda di sekitar sebagai senjata improvisasi yang efektif.",
    "Ascendant": "*Living Weapon*. Pengguna mampu menyalurkan sebagian kecil dari Aether atau jiwa mereka ke dalam senjata, memberinya ketajaman atau kekuatan magis sementara, atau bahkan membuatnya bergerak sesuai kehendak dalam jangkauan pendek."
  },
  "SynergyAndConflict": {
    "Synergy": "Sangat kuat jika digabungkan dengan *Ancient Martial Arts* untuk mengeksekusi teknik senjata yang rumit, atau dengan *Shadow Step* untuk melakukan serangan kejutan.",
    "Conflict": "Tidak ada konflik langsung."
  },
  "LoreAndHistory": "Skill ini sering dikaitkan dengan dewa perang atau pahlawan legendaris yang dikenal mampu memenangkan pertempuran seorang diri melawan ribuan musuh. Salah satu cerita yang paling terkenal adalah tentang seorang Ratu Prajurit yang mengalahkan pasukan musuh hanya dengan menggunakan alat-alat pertanian setelah pasukannya dilucuti."
}